SteveLRojas/mcu_libs/CH552/CH552_BME280/CH552_USB_CDC.c
/* USB Device String Product */
UINT8 code cdc_string_product[] =
{
    22,
    0x03,
    'U', 0, 'S', 0, 'B', 0, ' ', 0, 'S', 0, 'e', 0, 'r', 0, 'i', 0, 'a', 0, 'l', 0
};

/* USB Device String Serial */
#if CDC_USE_UNIQUE_ID
UINT8 code cdc_string_serial[] = {22, 0x03};
#else
UINT8 code cdc_string_serial[] =
{
	22,
	0x03,
	'D', 0, 'E', 0, 'A', 0, 'D', 0, 'B', 0, 'E', 0 , 'E', 0, 'F', 0, '0', 0, '1', 0
};
#endif

UINT8 code cdc_serial_state[] = {0xA1, 0x20, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00};


void cdc_copy_descriptor(UINT8 len)
{
	UINT8* dest = ep0_buffer;
	while(len)
	{
		*dest = *descriptor_ptr;
		++dest;
		++descriptor_ptr;
		--len;
	}
}

#if CDC_USE_UNIQUE_ID
void cdc_gen_string_serial(UINT8 len)
{
	UINT8* dest = ep0_buffer;
	UINT16 chip_id;
	UINT8 id_hex;
	while(len && (cdc_string_serial_offset < 2))
	{
		*dest = cdc_string_serial[cdc_string_serial_offset];
		dest += 1;
		cdc_string_serial_offset += 1;
		len -= 1;
	}
	
	while(len)
	{
		if(cdc_string_serial_offset & 0x01)
		{
			*dest = 0x00;
		}
		else
		{
			chip_id = ROM_CHIP_ID_HX | 0x01;	//The LSB is set here and byte order reversed later to skip constant at 0x3FFB
			chip_id = (chip_id + ((cdc_string_serial_offset - 2) >> 2)) ^ 0x01;
			id_hex = *((UINT8 code*)chip_id);
			if((cdc_string_serial_offset >> 1) & 0x01)
				id_hex = id_hex >> 4;
			id_hex &= 0x0F;
			if(id_hex < 10)
				id_hex += '0';
			else
				id_hex += 'A' - 10;
			*dest = id_hex;
		}
		dest += 1;
		cdc_string_serial_offset += 1;
		len -= 1;
	}
}
#endif

// HINT: This library contains some nasty hacks to work around bugs in CH552.
// Enabling SOF interrupts makes interrupt transfers fail, since the SOF triggers UIF_TRANSFER (all enpoints respond with NAK while UIF_TRANSFER is set).
// When a notification needs to be sent the SOF interrupts are disabled so that the interrupt transfer can happen.
// SOF interrupts are re-enabled after the interrupt transfer completes.
void cdc_on_sof(void)
{	
	// check for timeout, if the buffer is not being written to then enable transmitting and mark the buffer as full
	if(((sof_count - cdc_last_data_time) >= CDC_TIMEOUT_MS) && !(ep3_wip | cdc_tx_enabled))
	{
		if(ep3_write_select)
		{
			usb_set_ep3_tx_len(ep3_t1_num_bytes);
			ep3_t1_num_bytes = CDC_ENDP3_SIZE;
			ep3_write_select = 0;
		}
		else
		{
			usb_set_ep3_tx_len(ep3_t0_num_bytes);
			ep3_t0_num_bytes = CDC_ENDP3_SIZE;
			ep3_write_select = 1;
		}
		usb_set_ep3_in_res(USB_IN_RES_EXPECT_ACK);
		cdc_tx_enabled = 1;
	}
		
	if((sof_count - cdc_last_status_time) >= CDC_TIMEOUT_MS)
	{
		usb_set_ep1_tx_len(CDC_SERIAL_STATE_SIZE);
		usb_set_ep1_in_res(USB_IN_RES_EXPECT_ACK);
		usb_disable_interrupts(USB_INT_SOF);
	}
}

void cdc_on_out(UINT8 ep)
{
	UINT8 idx;
	
	if(ep == EP_0)
	{
		if((cdc_setup_req == SET_LINE_CODING) && ((cdc_setup_type & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS))
		{
			for(idx = 0; idx < CDC_LINE_CODING_SIZE; idx++)
			{
				((UINT8*)&cdc_line_coding)[idx] = ep0_buffer[idx];
			}
		}
		usb_set_ep0_tx_len(0);
		usb_set_ep0_tog_res(EP_OUT_TOG_1 | EP_IN_TOG_1 | USB_OUT_RES_ACK | USB_IN_RES_EXPECT_ACK);
	}
	
	if((ep == EP_2) && usb_is_toggle_ok())
	{
		//auto-toggle is enabled, so here the toggle should point to the next buffer that will receive
		if(usb_get_ep2_out_toggle())
		{
			ep2_t0_num_bytes = usb_get_rx_len();
#if CDC_HANDLE_ZLP
			ep2_t0_zlp = !ep2_t0_num_bytes;
#endif
			if(ep2_t1_num_bytes)
			{
				usb_set_ep2_out_res(USB_OUT_RES_NAK);
			}
		}
		else
		{
			ep2_t1_num_bytes = usb_get_rx_len();
#if CDC_HANDLE_ZLP
			ep2_t1_zlp = ! ep2_t1_num_bytes;
#endif
			if(ep2_t0_num_bytes)
			{
				usb_set_ep2_out_res(USB_OUT_RES_NAK);
			}
		}
	}
}

void cdc_on_in(UINT8 ep)
{
	UINT8 len;
	
	if(ep == EP_0)
	{
		if((cdc_setup_type & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD)
		{
			switch(cdc_setup_req)
			{
				case USB_GET_DESCRIPTOR:
					len = cdc_setup_len >= CDC_ENDP0_SIZE ? CDC_ENDP0_SIZE : cdc_setup_len;
#if CDC_USE_UNIQUE_ID
					if(cdc_string_serial_offset)
						cdc_gen_string_serial(len);
					else
						cdc_copy_descriptor(len);
#else
					cdc_copy_descriptor(len);
#endif
					cdc_setup_len -= len;
					usb_set_ep0_tx_len(len);
					usb_toggle_ep0_in_toggle();
					break;
				case USB_SET_ADDRESS:
					usb_set_addr(cdc_address);
					usb_set_ep0_in_res(USB_IN_RES_NAK);
					break;
				default:
					usb_set_ep0_tx_len(0);
					usb_set_ep0_in_res(USB_IN_RES_NAK);
					break;
			}
		}
		else
		{
			usb_set_ep0_tx_len(0);
			usb_set_ep0_in_res(USB_IN_RES_NAK);
		}
	}
	
	if(ep == EP_1)
	{
		usb_set_ep1_tx_len(0);
		usb_set_ep1_in_res(USB_IN_RES_NAK);
		cdc_last_status_time = sof_count;
		usb_enable_interrupts(USB_INT_SOF);
		++sof_count;
	}
	
	if(ep == EP_3)
	{
		cdc_last_data_time = sof_count;
		usb_set_ep3_tx_len(CDC_ENDP3_SIZE);
		//auto-toggle is enabled, so here the toggle should point to the next buffer that will transmit
		if(usb_get_ep3_in_toggle())
		{
			ep3_t0_num_bytes = 0;
			if(ep3_t1_num_bytes != CDC_ENDP3_SIZE)
			{
				usb_set_ep3_tx_len(0);
				usb_set_ep3_in_res(USB_IN_RES_NAK);
				cdc_tx_enabled = 0;
			}
		}
		else
		{
			ep3_t1_num_bytes = 0;
			if(ep3_t0_num_bytes != CDC_ENDP3_SIZE)
			{
				usb_set_ep3_tx_len(0);
				usb_set_ep3_in_res(USB_IN_RES_NAK);
				cdc_tx_enabled = 0;
			}
		}
	}
}

void cdc_on_setup(UINT8 ep)
{
	UINT8 len;
	UINT8 idx;
	
	if(ep == EP_0)
	{
		cdc_setup_len = ((UINT16)cdc_setup_buf->wLengthH<<8) | (cdc_setup_buf->wLengthL);
		cdc_setup_req = cdc_setup_buf->bRequest;
		cdc_setup_type = cdc_setup_buf->bRequestType;
		descriptor_ptr = (UINT8 code*)NULL;
#if CDC_USE_UNIQUE_ID
		cdc_string_serial_offset = 0;
#endif
		len = 0;
		
		if((cdc_setup_type & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD)
		{
			switch(cdc_setup_req)
			{
				case USB_GET_DESCRIPTOR:
					switch(cdc_setup_buf->wValueH)
					{
						case USB_DESCR_TYP_DEVICE:
							descriptor_ptr = cdc_device_descriptor;
							len = CDC_DEV_DESCR_SIZE;
							break;
						case USB_DESCR_TYP_CONFIG:
							descriptor_ptr = cdc_config_descriptor;
							len = CDC_CONF_DESCR_SIZE;
							break;
						case USB_DESCR_TYP_STRING:
							switch(cdc_setup_buf->wValueL)
							{
								case 0:
									descriptor_ptr = cdc_string_lang_id;
									break;
								case 1:
									descriptor_ptr = cdc_string_vendor;
									break;
								case 2:
									descriptor_ptr = cdc_string_product;
									break;
								case 3:
									descriptor_ptr = cdc_string_serial;
#if CDC_USE_UNIQUE_ID
									cdc_string_serial_offset = 0xFF;
#endif
									break;
								case 4:
									descriptor_ptr = cdc_string_product;
									break;
								default:
									descriptor_ptr = cdc_string_product;
									break;
							}
							len = descriptor_ptr[0];
							break;
						default:
							len = 0xFF;
							break;
					}
					break;
				case USB_SET_ADDRESS:
					cdc_address = cdc_setup_buf->wValueL;
					break;
				case USB_GET_CONFIGURATION:
					ep0_buffer[0] = cdc_config;
					len = 1;
					break;
				case USB_SET_CONFIGURATION:
					cdc_config = cdc_setup_buf->wValueL;
					usb_enable_interrupts(USB_INT_SOF);
					break;
				case USB_GET_INTERFACE:
					ep0_buffer[0] = 0;
					len = 1;
					break;
				case USB_SET_INTERFACE:
					//nothing to do here
					break;
				case USB_GET_STATUS:
					ep0_buffer[0] = 0x00;
					ep0_buffer[1] = 0x00;
					len = 2;
					break;
				case USB_CLEAR_FEATURE:
					if((cdc_setup_type & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)
					{
						switch(cdc_setup_buf->wIndexL)
						{
							case 0x01:
								usb_set_ep1_out_toggle(EP_OUT_TOG_0);
								usb_set_ep1_out_res(USB_OUT_RES_ACK);
								break;
							case 0x81:
								usb_set_ep1_in_toggle(EP_IN_TOG_0);
								usb_set_ep1_in_res(USB_IN_RES_NAK);
								usb_enable_interrupts(USB_INT_SOF);	//SOF interrupts must be enabled when EP1 is not ready
								break;
							case 0x02:
								usb_set_ep2_out_toggle(EP_OUT_TOG_0);
								usb_set_ep2_out_res(USB_OUT_RES_ACK);
								break;
							case 0x82:
								usb_set_ep2_in_toggle(EP_IN_TOG_0);
								usb_set_ep2_in_res(USB_IN_RES_NAK);
								break;
							case 0x03:
								usb_set_ep3_out_toggle(EP_OUT_TOG_0);
								usb_set_ep3_out_res(USB_OUT_RES_ACK);
								break;
							case 0x83:
								usb_set_ep3_in_toggle(EP_IN_TOG_0);
								usb_set_ep3_in_res(USB_IN_RES_NAK);
								break;
							default:
								len = 0xFF;
								break;
						}
					}
					else
					{
						len = 0xFF;
					}
					break;
				case USB_SET_FEATURE:
					if(((cdc_setup_type & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) && !cdc_setup_buf->wIndexH)
					{
						switch(cdc_setup_buf->wIndexL)
						{
							case 0x01:
								usb_set_ep1_out_toggle(EP_OUT_TOG_0);
								usb_set_ep1_out_res(USB_OUT_RES_STALL);
								break;
							case 0x81:
								usb_set_ep1_in_toggle(EP_IN_TOG_0);
								usb_set_ep1_in_res(USB_IN_RES_STALL);
								usb_enable_interrupts(USB_INT_SOF);	//SOF interrupts must be enabled when EP1 is not ready
								break;
							case 0x02:
								usb_set_ep2_out_toggle(EP_OUT_TOG_0);
								usb_set_ep2_out_res(USB_OUT_RES_STALL);
								break;
							case 0x82:
								usb_set_ep2_in_toggle(EP_IN_TOG_0);
								usb_set_ep2_in_res(USB_IN_RES_STALL);
								break;
							case 0x03:
								usb_set_ep3_out_toggle(EP_OUT_TOG_0);
								usb_set_ep3_out_res(USB_OUT_RES_STALL);
								break;
							case 0x83:
								usb_set_ep3_in_toggle(EP_IN_TOG_0);
								usb_set_ep3_in_res(USB_IN_RES_STALL);
								break;
							default:
								len = 0xFF;
								break;
						}
					}
					else
					{
						len = 0xFF;
					}
					break;
				default:
					len = 0xFF;
					break;
			}
		}
		else if((cdc_setup_type & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS)
		{
			switch(cdc_setup_req)
			{
				case GET_LINE_CODING:
					for(idx = 0; idx < CDC_LINE_CODING_SIZE; ++idx)
					{
						ep0_buffer[idx] = ((UINT8*)&cdc_line_coding)[idx];
					}
					len = CDC_LINE_CODING_SIZE;
					break;
				case SET_CONTROL_LINE_STATE:
					cdc_control_line_state = ep0_buffer[2];
					break;
				case SET_LINE_CODING:
					// nothing to do here
					break;
				default:
					len = 0xFF;
					break;
			}
		}
		else
		{
			len = 0xFF;
		}
		
		if(len == 0xFF)
		{
			cdc_setup_req = 0xFF;
			usb_set_ep0_tog_res(EP_OUT_TOG_1 | EP_IN_TOG_1 | USB_OUT_RES_STALL | USB_IN_RES_STALL);
		}
		else
		{
			if(cdc_setup_len > len)
				cdc_setup_len = len;
			len = (cdc_setup_len > CDC_ENDP0_SIZE) ? CDC_ENDP0_SIZE : cdc_setup_len;

