SteveLRojas/mcu_libs/CH552/CH552_BME280/CH552_USB_CDC.c
#if CDC_USE_UNIQUE_ID			
			if(cdc_string_serial_offset)
			{
				cdc_string_serial_offset = 0;
				cdc_gen_string_serial(len);
			}
			else if(descriptor_ptr != (UINT8 code*)NULL)
				cdc_copy_descriptor(len);
#else
			if(descriptor_ptr != (UINT8 code*)NULL)
				cdc_copy_descriptor(len);
#endif
			
			cdc_setup_len -= len;
			usb_set_ep0_tx_len(len);
			usb_set_ep0_tog_res(EP_OUT_TOG_1 | EP_IN_TOG_1 | USB_OUT_RES_ACK | USB_IN_RES_EXPECT_ACK);
		}
	}	//end if(ep == EP_0)
}

void cdc_on_rst(void)
{
	usb_disable_interrupts(USB_INT_SOF);

#if CDC_HANDLE_ZLP
	ep2_t0_zlp = 0;
	ep2_t1_zlp = 0;
#endif
	ep2_read_select = 0;
	ep2_t0_num_bytes = 0;
	ep2_t0_read_offset = 0;
	ep2_t1_num_bytes = 0;
	ep2_t1_read_offset = 0;
	
	ep3_wip = 0;
	ep3_write_select = 0;
	ep3_t0_num_bytes = 0;
	ep3_t1_num_bytes = 0;
	
	usb_set_ep0_tog_res(USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_0);
	usb_set_ep1_tog_res(USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_1);
	usb_set_ep2_tog_res(USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_1);
	usb_set_ep3_tog_res(USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_1);
	
	cdc_last_data_time = 0;
	cdc_last_status_time = 0;
	sof_count = 0;
	cdc_config = 0;
	cdc_tx_enabled = 0;
}

void cdc_enable_tx(void)
{
	// check toggle, if the buffer pointed to by the toggle is completely full then enable transmitting
	if(!cdc_tx_enabled && ((usb_get_ep3_in_toggle() ? ep3_t1_num_bytes : ep3_t0_num_bytes) == CDC_ENDP3_SIZE))
	{
		usb_set_ep3_tx_len(CDC_ENDP3_SIZE);
		usb_set_ep3_in_res(USB_IN_RES_EXPECT_ACK);
		cdc_tx_enabled = 1;
	}
}

void cdc_enable_rx(void)
{
	// check toggle, if the buffer pointed to by the toggle is empty then enable receiving
	if(usb_get_ep2_out_res() && ((usb_get_ep2_out_toggle() ? ep2_t1_num_bytes : ep2_t0_num_bytes) == 0))
	{
		usb_set_ep2_out_res(USB_OUT_RES_ACK);
	}
}

usb_config_t code usb_config = 
{
	(UINT16)ep0_buffer,
	(UINT16)ep1_buffer,
	(UINT16)ep2_t0_buffer,
	(UINT16)ep3_t0_buffer,
	USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_0,
	USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_1,
	USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_1,
	USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_1,
	USB_OUT_RES_ACK | USB_IN_RES_NAK | EP_OUT_TOG_0 | EP_IN_TOG_0 | EP_AUTOTOG_0,
	USB_EP1_TX_EN | USB_EP1_BUF_SINGLE,
	USB_EP2_RX_EN | USB_EP2_BUF_DOUBLE | USB_EP3_TX_EN | USB_EP3_BUF_DOUBLE,
	USB_INT_TRANSFER | USB_INT_RST
};

void cdc_init(void)
{
	usb_sof_callback = cdc_on_sof;
	usb_out_callback = cdc_on_out;
	usb_in_callback = cdc_on_in;
	usb_setup_callback = cdc_on_setup;
	usb_rst_callback = cdc_on_rst;
	usb_suspend_callback = NULL;
	
	usb_init(&usb_config);
	cdc_set_serial_state(0x00);
	cdc_config = 0;
}

void cdc_set_serial_state(UINT8 val)
{
	UINT8 idx;
	for(idx = 0; idx < CDC_SERIAL_STATE_SIZE; ++idx)
	{
		ep1_buffer[idx] = cdc_serial_state[idx];
	}
	ep1_buffer[8] = val;
	usb_set_ep1_tx_len(CDC_SERIAL_STATE_SIZE);
	usb_set_ep1_in_res(USB_IN_RES_EXPECT_ACK);
}

// Receive
UINT16 cdc_bytes_available(void)
{
	// count the number of bytes available in both buffers
	return (ep2_t0_num_bytes - ep2_t0_read_offset) + (ep2_t1_num_bytes - ep2_t1_read_offset);
}

UINT8 cdc_peek(void)
{
#if CDC_HANDLE_ZLP
	if(ep2_read_select && ep2_t1_zlp)
	{
		ep2_t1_zlp = 0;
		ep2_read_select = 0;
		cdc_enable_rx();
	}
	else if(!ep2_read_select && ep2_t0_zlp)
	{
		ep2_t0_zlp = 0;
		ep2_read_select = 1;
		cdc_enable_rx();
	}
#endif
	
	if(ep2_read_select)
		return ep2_t1_buffer[ep2_t1_read_offset];
	else
		return ep2_t0_buffer[ep2_t0_read_offset];
}

UINT8 cdc_read_byte(void)
{
	UINT8 read_val;
	
	while(!cdc_bytes_available());
#if CDC_HANDLE_ZLP
	if(ep2_read_select && ep2_t1_zlp)
	{
		ep2_t1_zlp = 0;
		ep2_read_select = 0;
		cdc_enable_rx();
	}
	else if(!ep2_read_select && ep2_t0_zlp)
	{
		ep2_t0_zlp = 0;
		ep2_read_select = 1;
		cdc_enable_rx();
	}
#endif
	
	if(ep2_read_select)
	{
		read_val = ep2_t1_buffer[ep2_t1_read_offset];
		++ep2_t1_read_offset;
		if(ep2_t1_read_offset == ep2_t1_num_bytes)
		{
			ep2_t1_read_offset = 0;
			ep2_t1_num_bytes = 0;
			ep2_read_select = 0;
			cdc_enable_rx();
		}
	}
	else
	{
		read_val = ep2_t0_buffer[ep2_t0_read_offset];
		++ep2_t0_read_offset;
		if(ep2_t0_read_offset == ep2_t0_num_bytes)
		{
			ep2_t0_read_offset = 0;
			ep2_t0_num_bytes = 0;
			ep2_read_select = 1;
			cdc_enable_rx();
		}
	}
	
	return read_val;
}

void cdc_read_bytes(UINT8* dest, UINT16 num_bytes)
{
	UINT16 num_to_read = 0;

	while(num_bytes)
	{
		if(ep2_read_select)
		{
			num_to_read = ep2_t1_num_bytes - ep2_t1_read_offset;
			if(!num_to_read)
			{
#if CDC_HANDLE_ZLP
				if(ep2_t1_zlp)
				{
					ep2_t1_zlp = 0;
					ep2_read_select = 0;
					cdc_enable_rx();
				}
#endif
				continue;
			}
			if(num_to_read > num_bytes)
			{
				num_to_read = num_bytes;
			}
			
			num_bytes -= num_to_read;
			do
			{
				*dest = ep2_t1_buffer[ep2_t1_read_offset];
				++dest;
				++ep2_t1_read_offset;
			} while(--num_to_read);
			
			if(ep2_t1_read_offset == ep2_t1_num_bytes)
			{
				ep2_t1_read_offset = 0;
				ep2_t1_num_bytes = 0;
				ep2_read_select = 0;
				cdc_enable_rx();
			}
		}
		else
		{
			num_to_read = ep2_t0_num_bytes - ep2_t0_read_offset;
			if(!num_to_read)
			{
#if CDC_HANDLE_ZLP
				if(ep2_t0_zlp)
				{
					ep2_t0_zlp = 0;
					ep2_read_select = 1;
					cdc_enable_rx();
				}
#endif
				continue;
			}
			if(num_to_read > num_bytes)
			{
				num_to_read = num_bytes;
			}
			
			num_bytes -= num_to_read;
			do
			{
				*dest = ep2_t0_buffer[ep2_t0_read_offset];
				++dest;
				++ep2_t0_read_offset;
			} while(--num_to_read);
			
			if(ep2_t0_read_offset == ep2_t0_num_bytes)
			{
				ep2_t0_read_offset = 0;
				ep2_t0_num_bytes = 0;
				ep2_read_select = 1;
				cdc_enable_rx();
			}
		}
	}
}

// Send
UINT16 cdc_bytes_available_for_write(void)
{
	return (CDC_ENDP3_SIZE - ep3_t0_num_bytes) + (CDC_ENDP3_SIZE - ep3_t1_num_bytes);
}

