SteveLRojas/mcu_libs/CH552/CH552_BME280/CH552_USB_CDC.c
void cdc_write_byte(UINT8 val)
{
	UINT8 ep_num_bytes;
	ep3_wip = 1;
	if(ep3_write_select)
	{
		ep_num_bytes = ep3_t1_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_wip = 0;
			return;
		}
		ep3_t1_buffer[ep_num_bytes] = val;
		++ep_num_bytes;
		ep3_t1_num_bytes = ep_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_write_select = 0;
			cdc_enable_tx();
		}
	}
	else
	{
		ep_num_bytes = ep3_t0_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_wip = 0;
			return;
		}
		ep3_t0_buffer[ep_num_bytes] = val;
		++ep_num_bytes;
		ep3_t0_num_bytes = ep_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_write_select = 1;
			cdc_enable_tx();
		}
	}
	ep3_wip = 0;
}

void cdc_write_bytes(UINT8* src, UINT16 num_bytes)
{
	UINT16 num_to_write = 0;
	UINT8 ep_num_bytes;
	
	ep3_wip = 1;
	while(num_bytes)
	{
		if(ep3_write_select)
		{
			ep_num_bytes = ep3_t1_num_bytes;
			num_to_write = CDC_ENDP3_SIZE - ep_num_bytes;
			if(!num_to_write)
				continue;
			if(num_to_write > num_bytes)
				num_to_write = num_bytes;
			
			num_bytes -= num_to_write;
			do
			{
				ep3_t1_buffer[ep_num_bytes] = *src;
				++src;
				++ep_num_bytes;
			} while(--num_to_write);
			ep3_t1_num_bytes = ep_num_bytes;
			
			if(ep_num_bytes == CDC_ENDP3_SIZE)
			{
				ep3_write_select = 0;
				cdc_enable_tx();
			}
		}
		else
		{
			ep_num_bytes = ep3_t0_num_bytes;
			num_to_write = CDC_ENDP3_SIZE - ep_num_bytes;
			if(!num_to_write)
				continue;
			if(num_to_write > num_bytes)
				num_to_write = num_bytes;
			
			num_bytes -= num_to_write;
			do
			{
				ep3_t0_buffer[ep_num_bytes] = *src;
				++src;
				++ep_num_bytes;
			} while(--num_to_write);
			ep3_t0_num_bytes = ep_num_bytes;
			
			if(ep_num_bytes == CDC_ENDP3_SIZE)
			{
				ep3_write_select = 1;
				cdc_enable_tx();
			}
		}
	}
	ep3_wip = 0;
}

void cdc_write_string(char* src)
{
	UINT16 len = 0;
	char* src_copy = src;
	while(*src_copy)
	{
		++len;
		++src_copy;
	}
	cdc_write_bytes(src, len);
}
